def sort_key(number):
    """아래에서 리스트를 정렬하기위한 기준을 제공하는 함수.
    예를들어 3과 32, 그리고 373을 비교할때, 이 함수의 출력값은 각각
    0.33333, 0.3232323232, 0.373373373373373 이 되고,
    따라서 reverse=True하에 373, 3, 32 순으로 배열된다. 
    이렇게 정렬하는 이유는, 이후 숫자를 이어붙일 때 어떤숫자 뒤에 자기 자신이 왔을때 보다 더 좋은 수가 있다면,
    그 수는 애초에 어떤 숫자 앞으로 가는것이 더 커질 것이기 때문.
    예를들어 3과 32, 373 의 경우, 최대의 수는 373/3/32인데, 
    이렇게 되는 이유는 373/3/32가 373/32/3를 비교해보면 알 수 있다.
    (말로 직관을 설명하려니 안 되는것 같다....)
    
    5번 이어주는 이유는 숫자가 최대 네자리 수이기 때문.
    """
    return float('0.'+number*5)

def solution(numbers):
    numbers = list(map(str,numbers))
    numbers.sort(key=sort_key, reverse=True)
    return str(int(''.join(numbers))) 
#입력 숫자가 0 여러개인 경우 "000"이런식으로 출력되면 기댓값과 다르다 나오기때문에 str,int로 다시 감싸주었다.